Конфигурация/InformationRegisters/ЗначенияНастроекУчетаЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНастроекУчетаЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияНастроекУчетаЦенныхБумаг/Forms/ФормаОтображенияНастроек/Ext/Form/Module.bsl
&НаКлиенте
Функция ОпределитьИмяТекущегоЭлементаИРеквизита()
	// Для того чтобы в будущем добавить новые закладки, с новыми таблицами. 
    // См. Обработки.НастройкаУчета
	Возврат "НастройкиУчетаЦенныхБумаг";

КонецФункции
	
&НаКлиенте
Процедура Развернуть(Команда)
	ИмяТекущегоЭлементаИРеквизита = ОпределитьИмяТекущегоЭлементаИРеквизита();
	Если ИмяТекущегоЭлементаИРеквизита <> "" Тогда
		РазвернутьДерево(ЭтаФорма[ИмяТекущегоЭлементаИРеквизита], ЭтаФорма.Элементы[ИмяТекущегоЭлементаИРеквизита]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	ИмяТекущегоЭлементаИРеквизита = ОпределитьИмяТекущегоЭлементаИРеквизита();
	Если ИмяТекущегоЭлементаИРеквизита <> "" Тогда
		СвернутьДерево(ЭтаФорма[ИмяТекущегоЭлементаИРеквизита], ЭтаФорма.Элементы[ИмяТекущегоЭлементаИРеквизита]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Элемент, ЭлементФормы)

	РаботаСФормамиКлиент.РазвернутьВсеЭлементыДерева(Элемент, ЭлементФормы); 

КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Элемент, ЭлементФормы)
	
	РаботаСФормамиКлиент.СвернутьВсеЭлементыДерева(Элемент, ЭлементФормы); 

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЭтаФорма.Параметры.Свойство("ЦеннаяБумага") Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задана облигация!",,,, Отказ);
		
		Возврат;
		
	Иначе
		
		ЭтаФорма.ЦеннаяБумага = ЭтаФорма.Параметры.ЦеннаяБумага;
		ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
		ОбновитьНастройкиУчетаЦенныхБумаг();		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиУчетаЦенныхБумаг()

	ЭтаФорма.НастройкиУчетаЦенныхБумаг.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Клиент КАК Клиент,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Настройка КАК Настройка,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Партия КАК Партия,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.СтрокаПартии КАК СтрокаПартии,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Период КАК Период,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЗначениеНастройки КАК ЗначениеНастройки,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Отключить КАК Отключить,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.УчетныйАктивЕПС.Представление КАК УчетныйАктивЕПСПредставление,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Клиент.Представление КАК КлиентПредставление,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Настройка.Представление КАК НастройкаПредставление,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Партия.Представление КАК ПартияПредставление
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг.СрезПоследних КАК ЗначенияНастроекУчетаЦенныхБумагСрезПоследних
		|ГДЕ
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЦеннаяБумага = &ЦеннаяБумага
		|	И ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	УчетныйАктивЕПС,
		|	Настройка,
		|	Партия,
		|	СтрокаПартии,
		|	Период
		|ИТОГИ ПО
		|	Клиент,
		|	УчетныйАктивЕПС,
		|	Настройка,
		|	Партия,
		|	СтрокаПартии
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтаФорма.ЦеннаяБумага);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКлиент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКлиент.Следующий() Цикл
		
		КлиентВДереве = ЭтаФорма.НастройкиУчетаЦенныхБумаг.ПолучитьЭлементы().Добавить();
		КлиентВДереве.Картинка = 6;
		КлиентВДереве.ИмяНастройки = "";
		КлиентВДереве.ПредставлениеНастройки = ВыборкаКлиент.КлиентПредставление;
		
		ВыборкаУчетныйАктивЕПС = ВыборкаКлиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУчетныйАктивЕПС.Следующий() Цикл
			
			УчетныйАктивЕПСВДереве = КлиентВДереве.ПолучитьЭлементы().Добавить();
			УчетныйАктивЕПСВДереве.Картинка = 6;
			УчетныйАктивЕПСВДереве.ИмяНастройки = "";
			УчетныйАктивЕПСВДереве.ПредставлениеНастройки = ВыборкаУчетныйАктивЕПС.УчетныйАктивЕПСПредставление;
			
			ВыборкаНастройка = ВыборкаУчетныйАктивЕПС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНастройка.Следующий() Цикл
				
				НастройкаВДереве = УчетныйАктивЕПСВДереве.ПолучитьЭлементы().Добавить();
				НастройкаВДереве.Картинка = 6;
				НастройкаВДереве.ИмяНастройки = "";
				НастройкаВДереве.ПредставлениеНастройки = ВыборкаНастройка.НастройкаПредставление;
				
				ВыборкаПартия = ВыборкаНастройка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПартия.Следующий() Цикл
					
					Если ЗначениеЗаполнено(ВыборкаПартия.Партия) Тогда
						ПартияВДереве = НастройкаВДереве.ПолучитьЭлементы().Добавить();
						ПартияВДереве.Картинка = 6;
						ПартияВДереве.ИмяНастройки = "";
						ПартияВДереве.ПредставлениеНастройки = ВыборкаПартия.ПартияПредставление;
					КонецЕсли;	
					
					ВыборкаСтрокаПартии = ВыборкаПартия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаСтрокаПартии.Следующий() Цикл
						
						Если ЗначениеЗаполнено(ВыборкаПартия.Партия) Тогда
							СтрокаПартииВДереве = ПартияВДереве.ПолучитьЭлементы().Добавить();
							СтрокаПартииВДереве.Картинка = 6;
							СтрокаПартииВДереве.ИмяНастройки = "";
							СтрокаПартииВДереве.ПредставлениеНастройки = ВыборкаСтрокаПартии.СтрокаПартии;
						КонецЕсли;
						
						ВыборкаДетальныеЗаписи = ВыборкаСтрокаПартии.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							
							Если ЗначениеЗаполнено(ВыборкаПартия.Партия) Тогда
								РеквизитВДереве = СтрокаПартииВДереве.ПолучитьЭлементы().Добавить();
							Иначе
								РеквизитВДереве = НастройкаВДереве.ПолучитьЭлементы().Добавить();
							КонецЕсли;
							
							
							РеквизитВДереве.Картинка = ОпределитьИконкуНаСервере(ТипЗнч(ВыборкаДетальныеЗаписи.ЗначениеНастройки));
							РеквизитВДереве.ИмяНастройки = "ЗначениеНастройки";
							РеквизитВДереве.ПредставлениеНастройки = "Значение настройки";
							РеквизитВДереве.ЗначениеНастройки = ВыборкаДетальныеЗаписи.ЗначениеНастройки;
							РеквизитВДереве.ДатаЗначения = ВыборкаДетальныеЗаписи.Период;
							РеквизитВДереве.ОтображаемаяДата = ВыборкаДетальныеЗаписи.Период;
							РеквизитВДереве.Отключить = ВыборкаДетальныеЗаписи.Отключить;
								
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
	
&НаСервере
Функция ОпределитьИконкуНаСервере(ТипРеквизита)
	
	Если ТипЗнч(ТипРеквизита) = Тип("Тип") Тогда
		
		МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТипРеквизита);
		
		Если ТипРеквизита = Тип("ПланСчетовСсылка.Основной") Тогда
			Возврат 0;
		ИначеЕсли ТипРеквизита = Тип("Булево") Тогда
			Возврат 1;
		ИначеЕсли ТипРеквизита = Тип("Число") Тогда
			Возврат 7;
		ИначеЕсли ТипРеквизита = Тип("Дата") Тогда
			Возврат 8;
		ИначеЕсли ТипРеквизита = Тип("Строка") Тогда
			Возврат 3;
		ИначеЕсли Метаданные.Перечисления.Содержит(МетаданныеРеквизита) Тогда
			Возврат 2;
		ИначеЕсли Метаданные.Документы.Содержит(МетаданныеРеквизита) Тогда
			Возврат 3;
		ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеРеквизита) Тогда
			Возврат 3;
		КонецЕсли;
		
	Иначе	
		
		МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТипРеквизита.Типы()[0]);
		
		Если ТипРеквизита.Типы()[0] = Тип("ПланСчетовСсылка.Основной") Тогда
			Возврат 0;
		ИначеЕсли ТипРеквизита.Типы()[0] = Тип("Булево") Тогда
			Возврат 1;
		ИначеЕсли ТипРеквизита.Типы()[0] = Тип("Число") Тогда
			Возврат 7;
		ИначеЕсли ТипРеквизита.Типы()[0] = Тип("Дата") Тогда
			Возврат 8;
		ИначеЕсли ТипРеквизита.Типы()[0] = Тип("Строка") Тогда
			Возврат 3;
		ИначеЕсли Метаданные.Перечисления.Содержит(МетаданныеРеквизита) Тогда
			Возврат 2;
		ИначеЕсли Метаданные.Документы.Содержит(МетаданныеРеквизита) Тогда
			Возврат 3;
		ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеРеквизита) Тогда
			Возврат 3;
		КонецЕсли;
		
	КонецЕсли;

КонецФункции
